day02/01gridConvergence/01shockTube_1000/system/blockMeshDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (-5 -1 -1)
    (5 -1 -1)
    (5 1 -1)
    (-5 1 -1)
    (-5 -1 1)
    (5 -1 1)
    (5 1 1)
    (-5 1 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (1000 1 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    sides
    {
        type patch;
        faces
        (
            (1 2 6 5)
            (0 4 7 3)
        );
    }
    empty
    {
        type empty;
        faces
        (
            (0 1 5 4)
            (5 6 7 4)
            (3 7 6 2)
            (0 3 2 1)
        );
    }
);

mergePatchPairs
(
);
